; domain
(define (domain blockWorld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates
    (on ?x - block ?y - block)
    (ontable ?x - block)
    (clear ?x - block)
    (handempty)
    (holding ?x - block))
  (:action pick-up
    ;;; action qui ramasse un bloc pose sur la table
    :parameters (?x - block)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (not (ontable ?x))
            (not (clear ?x))
            (not (handempty))
            (holding ?x)))
  (:action unstack
    ;;; action qui ramasse un bloc pose sur un autre
    :parameters (?x - block ?y - block)
    :precondition (and (clear ?x) (on ?x ?y) (handempty))
    :effect (and (not (on ?x ?y))
            (not (clear ?x))
            (not (handempty))
            (holding ?x)
            (clear ?y)))
  (:action put-down
    ;;; action qui pose un bloc sur la table
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (not (holding ?x))
            (clear ?x)
            (handempty)
            (ontable ?x)))
  (:action stack
    ;;; action qui pose un bloc sur un autre
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty)
            (on ?x ?y))))

; problem
(define (problem blockProblem2)
	(:domain blockWorld)
	(:objects A B C D E F G - block)
	(:init (clear G) (ontable A) (on B A) (on A F) (clear C) (ontable D) (on C D) (on E B) (on G E)(handempty))
	(:goal (and (on A B) (on B C) (on C D) (on D F) (handempty))))

; plan
1. (unstack g e)
   deleted: (on g e) (clear g) (handempty)
   added: (holding g) (clear e)
   goals met: 1 of 5
2. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 2 of 5
3. (unstack e b)
   deleted: (on e b) (clear e) (handempty)
   added: (holding e) (clear b)
   goals met: 1 of 5
4. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 2 of 5
5. (unstack c d)
   deleted: (on c d) (clear c) (handempty)
   added: (holding c) (clear d)
   goals met: 0 of 5
6. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 1 of 5
7. (unstack b a)
   deleted: (on b a) (clear b) (handempty)
   added: (holding b) (clear a)
   goals met: 0 of 5
8. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 1 of 5
9. (unstack a f)
   deleted: (on a f) (clear a) (handempty)
   added: (holding a) (clear f)
   goals met: 0 of 5
10. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty)
   goals met: 1 of 5
11. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 0 of 5
12. (stack d f)
   deleted: (holding d) (clear f)
   added: (clear d) (handempty) (on d f)
   goals met: 2 of 5
13. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 1 of 5
14. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 3 of 5
15. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 2 of 5
16. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 4 of 5
17. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 3 of 5
18. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 5 of 5
